MikroElektronika/mikrosdk_v2/targets/arm/mikroe/stm32/src/spi_master/implementation_1/hal_ll_spi_master.c
        low_level_handle->init_ll_state = false;

        hal_ll_spi_master_hw_specifics_map_local->mode = HAL_LL_SPI_MASTER_MODE_DEFAULT;
        hal_ll_spi_master_hw_specifics_map_local->speed = HAL_LL_SPI_MASTER_SPEED_100K;
        hal_ll_spi_master_hw_specifics_map_local->dummy_data = 0;
        hal_ll_spi_master_hw_specifics_map_local->hw_actual_speed = 0;

        hal_ll_spi_master_alternate_functions_set_state(hal_ll_spi_master_hw_specifics_map_local, false);
        hal_ll_spi_master_set_clock(hal_ll_spi_master_hw_specifics_map_local, false, &dummy);

        hal_ll_spi_master_hw_specifics_map_local->pins->sck->pin_name = HAL_LL_PIN_NC;
        hal_ll_spi_master_hw_specifics_map_local->pins->miso->pin_name = HAL_LL_PIN_NC;
        hal_ll_spi_master_hw_specifics_map_local->pins->mosi->pin_name = HAL_LL_PIN_NC;
        hal_ll_spi_master_hw_specifics_map_local->pins->sck->pin_af = 0;
        hal_ll_spi_master_hw_specifics_map_local->pins->miso->pin_af = 0;
        hal_ll_spi_master_hw_specifics_map_local->pins->mosi->pin_af = 0;
    }
}

// ----------------------------------------------- PRIVATE FUNCTION DEFINITIONS

uint8_t hal_ll_spi_master_transfer_bare_metal(hal_ll_spi_master_base_handle_t *hal_ll_hw_reg, uint8_t data_buffer) {
    // Write user-defined data ( 'hal_ll_spi_master_read_bare_metal' procedure will send dummy data ).
    *((volatile uint8_t *)&hal_ll_hw_reg->dr) = (uint8_t)data_buffer;    // 8-bit data

    // Wait for receive buffer not empty status.
    while (!(check_reg_bit( &(hal_ll_hw_reg->sr), HAL_LL_SPI_MASTER_RXNE)));

    // Return read data.
    return *((volatile uint8_t *)&hal_ll_hw_reg->dr);                // 8-bit data
}

static void hal_ll_spi_master_write_bare_metal( hal_ll_spi_master_base_handle_t *hal_ll_hw_reg, uint8_t *write_data_buffer, size_t write_data_length ) {
    uint16_t transfer_counter = NULL;

    // Write the first data to be transmitted into the SPI_DR register.
    for(transfer_counter = 0; transfer_counter < write_data_length; transfer_counter++) {
        // If we are good to go ( if the tx buffer value has been shifted to the shift register ), write the data.
        hal_ll_spi_master_transfer_bare_metal( hal_ll_hw_reg, write_data_buffer[transfer_counter]);
    }
}

static void hal_ll_spi_master_read_bare_metal(hal_ll_spi_master_base_handle_t *hal_ll_hw_reg, uint8_t *read_data_buffer, size_t read_data_length, uint8_t dummy_data) {
    uint16_t transfer_counter = NULL;

    // Read the first data to be transmitted into the SPI_DR register.
    for(transfer_counter = 0; transfer_counter < read_data_length; transfer_counter++) {
        // If we are good to go ( if the value from shift register has been shifted to the rx register ), read the data.
         read_data_buffer[transfer_counter] = hal_ll_spi_master_transfer_bare_metal(hal_ll_hw_reg, dummy_data);
    }
}

static hal_ll_pin_name_t hal_ll_spi_master_check_pins(hal_ll_pin_name_t sck_pin, hal_ll_pin_name_t miso_pin, hal_ll_pin_name_t mosi_pin, uint8_t *index_list) {
    uint8_t miso_index;
    uint8_t mosi_index;
    uint8_t sck_index;

    hal_ll_pin_name_t depth_sck_pin_map  = ( sizeof( _spi_sck_map ) ) / (sizeof(hal_ll_spi_master_pin_map_t));
    hal_ll_pin_name_t depth_miso_pin_map = ( sizeof( _spi_miso_map ) ) / (sizeof(hal_ll_spi_master_pin_map_t));
    hal_ll_pin_name_t depth_mosi_pin_map = ( sizeof( _spi_mosi_map ) ) / (sizeof(hal_ll_spi_master_pin_map_t));

    // Check pins from the specific pin maps with the user defined pins.
    for (sck_index = 0; sck_index < depth_sck_pin_map; sck_index++) {
        if (_spi_sck_map[sck_index]->pin == sck_pin) {
            for (miso_index = 0; miso_index < depth_miso_pin_map; miso_index++) {
                if (_spi_miso_map[miso_index]->pin == miso_pin) {
                    if (_spi_sck_map[sck_index]->base == _spi_miso_map[miso_index]->base) {
                        for (mosi_index = 0; mosi_index < depth_mosi_pin_map; mosi_index++) {
                            if (_spi_mosi_map[mosi_index]->pin ==  mosi_pin) {
                                if (_spi_sck_map[sck_index]->base == _spi_mosi_map[mosi_index]->base) {

                                    index_list[HAL_LL_SPI_SCK_PIN] = sck_index;
                                    index_list[HAL_LL_SPI_MISO_PIN] = miso_index;
                                    index_list[HAL_LL_SPI_MOSI_PIN] = mosi_index;

                                    return _spi_sck_map[sck_index]->module_index;
                                }
                            }
                        }
                    }
                }
            }
        }
    }

    return HAL_LL_PIN_NC;
}

static void hal_ll_spi_master_map_pins(uint8_t module_index, uint8_t *index_list) {
    // if every single pin is OK, insert them into this new map, and use this map in all low level functions.
    hal_ll_spi_master_hw_specifics_map[module_index]->pins.sck->pin_name  = _spi_sck_map[index_list[HAL_LL_SPI_SCK_PIN]]->pin;
    hal_ll_spi_master_hw_specifics_map[module_index]->pins.miso->pin_name = _spi_miso_map[index_list[HAL_LL_SPI_MISO_PIN]]->pin;
    hal_ll_spi_master_hw_specifics_map[module_index]->pins.mosi->pin_name = _spi_mosi_map[index_list[HAL_LL_SPI_MOSI_PIN]]->pin;

    // SCK, MISO and MOSI pins could have different alternate function settings, hence save all the AF-s.
    hal_ll_spi_master_hw_specifics_map[module_index]->pins.sck->pin_af   = _spi_sck_map[index_list[HAL_LL_SPI_SCK_PIN]]->af;
    hal_ll_spi_master_hw_specifics_map[module_index]->pins.miso->pin_af  = _spi_miso_map[index_list[HAL_LL_SPI_MISO_PIN]]->af;
    hal_ll_spi_master_hw_specifics_map[module_index]->pins.mosi->pin_af  = _spi_mosi_map[index_list[HAL_LL_SPI_MOSI_PIN]]->af;
}

static hal_ll_spi_master_hw_specifics_map_t *hal_ll_get_specifics(handle_t handle) {
    uint8_t hal_ll_module_count = sizeof(hal_ll_module_state) / (sizeof( hal_ll_spi_master_handle_register_t));

    static uint8_t hal_ll_module_error = hal_ll_module_count;

