MikroElektronika/mikrosdk_v2/targets/arm/mikroe/stm32/src/spi_master/implementation_1/hal_ll_spi_master.c
    while (hal_ll_module_count--) {
        if (hal_ll_spi_master_get_base_from_hal_handle == hal_ll_spi_master_hw_specifics_map[hal_ll_module_count]->base) {
            return &hal_ll_spi_master_hw_specifics_map[hal_ll_module_count];
        }
    }

    // If NOK, return pointer to the last row of this map ( point to null pointer ).
    return &hal_ll_spi_master_hw_specifics_map[hal_ll_module_error];
}

static void hal_ll_spi_master_set_clock(hal_ll_spi_master_hw_specifics_map_t *map, bool hal_ll_state, uint32_t *clock_value) {
    rcc_clocks_t hal_ll_spi_clock_structure;

    RCC_GetClocksFrequency(&hal_ll_spi_clock_structure);

    switch (map->module_index) {
        #if defined(SPI_MODULE_1)
        case (hal_ll_spi_master_module_num(SPI_MODULE_1)):
            if(hal_ll_state) {
                set_reg_bit(_RCC_APB2ENR, HAL_LL_SPI1_MASTER_ENABLE);
            } else {
                clear_reg_bit(_RCC_APB2ENR, HAL_LL_SPI1_MASTER_ENABLE);
            }
            #if defined (STM32F0xx) || (STM32G0xx)
            *clock_value = hal_ll_spi_clock_structure.pclk;
            #else
            *clock_value = hal_ll_spi_clock_structure.pclk2;
            #endif
            break;
        #endif
        #if defined(SPI_MODULE_2)
        case (hal_ll_spi_master_module_num(SPI_MODULE_2)):
            if(hal_ll_state) {
                #ifdef STM32L4xx
                    set_reg_bit(_RCC_APB1ENR1, HAL_LL_SPI2_MASTER_ENABLE);
                #else
                    set_reg_bit(_RCC_APB1ENR, HAL_LL_SPI2_MASTER_ENABLE);
                #endif
            } else {
                #ifdef STM32L4xx
                    clear_reg_bit(_RCC_APB1ENR1, HAL_LL_SPI2_MASTER_ENABLE);
                #else
                    clear_reg_bit(_RCC_APB1ENR, HAL_LL_SPI2_MASTER_ENABLE);
                #endif
            }
            #if defined (STM32F0xx) || (STM32G0xx)
            *clock_value = hal_ll_spi_clock_structure.pclk;
            #else
            *clock_value = hal_ll_spi_clock_structure.pclk1;
            #endif
            break;
        #endif
        #if defined(SPI_MODULE_3)
        case (hal_ll_spi_master_module_num(SPI_MODULE_3)):
            if(hal_ll_state) {
                #ifdef STM32L4xx
                    set_reg_bit(_RCC_APB1ENR1, HAL_LL_SPI3_MASTER_ENABLE);
                #else
                    set_reg_bit(_RCC_APB1ENR, HAL_LL_SPI3_MASTER_ENABLE);
                #endif
            } else {
                #ifdef STM32L4xx
                    clear_reg_bit(_RCC_APB1ENR1, HAL_LL_SPI3_MASTER_ENABLE);
                #else
                    clear_reg_bit(_RCC_APB1ENR, HAL_LL_SPI3_MASTER_ENABLE);
                #endif
            }
            *clock_value = hal_ll_spi_clock_structure.pclk1;
            break;
        #endif
        #if defined(SPI_MODULE_4)
        case (hal_ll_spi_master_module_num(SPI_MODULE_4)):
            if(hal_ll_state) {
                set_reg_bit(_RCC_APB2ENR, HAL_LL_SPI4_MASTER_ENABLE);
            } else {
                clear_reg_bit(_RCC_APB2ENR, HAL_LL_SPI4_MASTER_ENABLE);
            }
            *clock_value = hal_ll_spi_clock_structure.pclk2;
            break;
        #endif
        #if defined(SPI_MODULE_5)
        case (hal_ll_spi_master_module_num(SPI_MODULE_5)):
            if( hal_ll_state ) {
                set_reg_bit(_RCC_APB2ENR, HAL_LL_SPI5_MASTER_ENABLE);
            } else {
                clear_reg_bit(_RCC_APB2ENR, HAL_LL_SPI5_MASTER_ENABLE);
            }
            *clock_value = hal_ll_spi_clock_structure.pclk2;
            break;
        #endif
        #if defined(SPI_MODULE_6)
        case (hal_ll_spi_master_module_num(SPI_MODULE_6)):
            if(hal_ll_state) {
                set_reg_bit(_RCC_APB2ENR, HAL_LL_SPI6_MASTER_ENABLE);
            } else {
                clear_reg_bit(_RCC_APB2ENR, HAL_LL_SPI6_MASTER_ENABLE);
            }
            *clock_value = hal_ll_spi_clock_structure.pclk2;
            break;
        #endif

    }
}

static void hal_ll_spi_master_alternate_functions_set_state(hal_ll_spi_master_hw_specifics_map_t *map, bool hal_ll_state) {
    module_struct module;
    uint32_t spi_config;

    if((map->pins.sck.pin_name != HAL_LL_PIN_NC) && (map->pins.miso.pin_name != HAL_LL_PIN_NC) && (map->pins.miso.pin_name != HAL_LL_PIN_NC)) {
        module.pins[0] = VALUE(map->pins.sck.pin_name, map->pins.sck.pin_af);
        module.pins[1] = VALUE(map->pins.miso.pin_name, map->pins.miso.pin_af);
        module.pins[2] = VALUE(map->pins.mosi.pin_name, map->pins.mosi.pin_af);
        module.pins[3] = GPIO_MODULE_STRUCT_END;

        spi_config    = GPIO_CFG_MODE_ALT_FUNCTION |
                        GPIO_CFG_SPEED_HIGH |
                        GPIO_CFG_OTYPE_PP;

        module.configs[0] = spi_config;
        module.configs[1] = spi_config;
        module.configs[2] = spi_config;
        module.configs[3] = GPIO_MODULE_STRUCT_END;

        module.gpio_remap = map->pins.sck.pin_af;

        hal_ll_gpio_module_struct_init(&module, hal_ll_state);
    }
}

static uint32_t hal_ll_spi_master_hw_init(hal_ll_spi_master_hw_specifics_map_t *map, uint32_t clock_value) {
    uint32_t temp_speed;

    hal_ll_spi_master_base_handle_t *hal_ll_hw_reg = (hal_ll_spi_master_base_handle_t *)map->base;

    // Reset all the settings in control register.
    hal_ll_hw_reg->cr1 = 0;

    // Populate appropriate register values to get appropriate data transfer baud rate prescalers.
    temp_speed = hal_ll_spi_master_get_speed(clock_value, map->speed);
    hal_ll_hw_reg->cr1 |= temp_speed;

    // Choose whether idle state for the clock is high level (1) or low level (0).
    if (map->mode <= HAL_LL_SPI_MASTER_MODE_1) {
        clear_reg_bit(&(hal_ll_hw_reg->cr1), HAL_LL_SPI_MASTER_CLK_POLARITY);
    } else {
        set_reg_bit(&( hal_ll_hw_reg->cr1), HAL_LL_SPI_MASTER_CLK_POLARITY);
    }

	// Choose whether transmit occurs on the transition from ACTIVE to IDLE (1), or vice versa (0).
    if (map->mode == HAL_LL_SPI_MASTER_MODE_0 || map->mode == HAL_LL_SPI_MASTER_MODE_2) {
        clear_reg_bit(&(hal_ll_hw_reg->cr1), HAL_LL_SPI_MASTER_CLK_PHASE);
    } else {
        set_reg_bit(&(hal_ll_hw_reg->cr1), HAL_LL_SPI_MASTER_CLK_PHASE);
    }

    // Set default values for SPI Master configuration.
    set_reg_bit(&(hal_ll_hw_reg->cr1), HAL_LL_SPI_MASTER_SSM_ENABLE);
    set_reg_bit(&(hal_ll_hw_reg->cr1), HAL_LL_SPI_MASTER_SSI_1);
    set_reg_bit(&(hal_ll_hw_reg->cr1), HAL_LL_SPI_MASTER_SELECTION);

    // Set Slave Select Output Enable bit.
    set_reg_bit(&(hal_ll_hw_reg->cr2), HAL_LL_SPI_MASTER_SSOE_BIT);

    // Set FIFO reception threshold to 8-bit.
    hal_ll_hw_reg->cr2 |= HAL_LL_SPI_MASTER_FRXTH;

    // Enable SPI peripheral.
    set_reg_bit(&(hal_ll_hw_reg->cr1), HAL_LL_SPI_MASTER_ENABLE);

    return (hal_ll_spi_master_get_actual_speed(clock_value, temp_speed));
}

static void hal_ll_spi_master_init(hal_ll_spi_master_hw_specifics_map_t *map) {
    uint32_t clock_value;

    // Enable specific clock module.
    hal_ll_spi_master_set_clock (map, true, &clock_value);

    // Enable specific alternate functions.
    hal_ll_spi_master_alternate_functions_set_state(map, true);

    // Finally, write user-defined settings into hardware registers.
    hal_ll_spi_master_hw_init(map, clock_value);
}
// ------------------------------------------------------------------------- END
